DeepVegChicken/Learning-Keras_Model_Convert/2.Code/C_C++/board/pin_mux.h
/* GPIO_B1_01 (coord B11), LCDIF_D13 */
/* Routed pin properties */
#define BOARD_INITLCDPINS_LCDIF_D13_PERIPHERAL                             LCDIF   /*!< Peripheral name */
#define BOARD_INITLCDPINS_LCDIF_D13_SIGNAL                            lcdif_data   /*!< Signal name */
#define BOARD_INITLCDPINS_LCDIF_D13_CHANNEL                                  13U   /*!< Signal channel */

/* GPIO_B1_02 (coord C11), LCDIF_D14 */
/* Routed pin properties */
#define BOARD_INITLCDPINS_LCDIF_D14_PERIPHERAL                             LCDIF   /*!< Peripheral name */
#define BOARD_INITLCDPINS_LCDIF_D14_SIGNAL                            lcdif_data   /*!< Signal name */
#define BOARD_INITLCDPINS_LCDIF_D14_CHANNEL                                  14U   /*!< Signal channel */

/* GPIO_B1_03 (coord D11), LCDIF_D15 */
/* Routed pin properties */
#define BOARD_INITLCDPINS_LCDIF_D15_PERIPHERAL                             LCDIF   /*!< Peripheral name */
#define BOARD_INITLCDPINS_LCDIF_D15_SIGNAL                            lcdif_data   /*!< Signal name */
#define BOARD_INITLCDPINS_LCDIF_D15_CHANNEL                                  15U   /*!< Signal channel */

/* GPIO_B1_04 (coord E12), ENET_RXD0 */
/* Routed pin properties */
#define BOARD_INITLCDPINS_ENET_RXD0_PERIPHERAL                             LCDIF   /*!< Peripheral name */
#define BOARD_INITLCDPINS_ENET_RXD0_SIGNAL                            lcdif_data   /*!< Signal name */
#define BOARD_INITLCDPINS_ENET_RXD0_CHANNEL                                  16U   /*!< Signal channel */

/* GPIO_B1_05 (coord D12), ENET_RXD1 */
/* Routed pin properties */
#define BOARD_INITLCDPINS_ENET_RXD1_PERIPHERAL                             LCDIF   /*!< Peripheral name */
#define BOARD_INITLCDPINS_ENET_RXD1_SIGNAL                            lcdif_data   /*!< Signal name */
#define BOARD_INITLCDPINS_ENET_RXD1_CHANNEL                                  17U   /*!< Signal channel */

/* GPIO_B1_06 (coord C12), ENET_CRS_DV */
/* Routed pin properties */
#define BOARD_INITLCDPINS_ENET_CRS_DV_PERIPHERAL                           LCDIF   /*!< Peripheral name */
#define BOARD_INITLCDPINS_ENET_CRS_DV_SIGNAL                          lcdif_data   /*!< Signal name */
#define BOARD_INITLCDPINS_ENET_CRS_DV_CHANNEL                                18U   /*!< Signal channel */

/* GPIO_B1_07 (coord B12), ENET_TXD0 */
/* Routed pin properties */
#define BOARD_INITLCDPINS_ENET_TXD0_PERIPHERAL                             LCDIF   /*!< Peripheral name */
#define BOARD_INITLCDPINS_ENET_TXD0_SIGNAL                            lcdif_data   /*!< Signal name */
#define BOARD_INITLCDPINS_ENET_TXD0_CHANNEL                                  19U   /*!< Signal channel */

/* GPIO_B1_08 (coord A12), ENET_TXD1 */
/* Routed pin properties */
#define BOARD_INITLCDPINS_ENET_TXD1_PERIPHERAL                             LCDIF   /*!< Peripheral name */
#define BOARD_INITLCDPINS_ENET_TXD1_SIGNAL                            lcdif_data   /*!< Signal name */
#define BOARD_INITLCDPINS_ENET_TXD1_CHANNEL                                  20U   /*!< Signal channel */

/* GPIO_B1_09 (coord A13), ENET_TXEN */
/* Routed pin properties */
#define BOARD_INITLCDPINS_ENET_TXEN_PERIPHERAL                             LCDIF   /*!< Peripheral name */
#define BOARD_INITLCDPINS_ENET_TXEN_SIGNAL                            lcdif_data   /*!< Signal name */
#define BOARD_INITLCDPINS_ENET_TXEN_CHANNEL                                  21U   /*!< Signal channel */

/* GPIO_B1_10 (coord B13), ENET_TX_CLK */
/* Routed pin properties */
#define BOARD_INITLCDPINS_ENET_TX_CLK_PERIPHERAL                           LCDIF   /*!< Peripheral name */
#define BOARD_INITLCDPINS_ENET_TX_CLK_SIGNAL                          lcdif_data   /*!< Signal name */
#define BOARD_INITLCDPINS_ENET_TX_CLK_CHANNEL                                22U   /*!< Signal channel */

/* GPIO_B1_11 (coord C13), ENET_RXER */
/* Routed pin properties */
#define BOARD_INITLCDPINS_ENET_RXER_PERIPHERAL                             LCDIF   /*!< Peripheral name */
#define BOARD_INITLCDPINS_ENET_RXER_SIGNAL                            lcdif_data   /*!< Signal name */
#define BOARD_INITLCDPINS_ENET_RXER_CHANNEL                                  23U   /*!< Signal channel */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLCDPins(void);
void BOARD_InitSDPins(void);
#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
